
#include "ssd1306.h"
#include "handl_ssd1306.h"
//#include "main.h"


extern I2C_HandleTypeDef hi2c2;
extern void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c);

//==============================================================================
// Р В РЎСџР РЋР вЂљР В РЎвЂўР РЋРІР‚В Р В Р’ВµР В РўвЂ�Р РЋРЎвЂњР РЋР вЂљР В Р’В° Р В РЎвЂ�Р В Р вЂ¦Р В РЎвЂ�Р РЋРІР‚В Р В РЎвЂ�Р В Р’В°Р В Р’В»Р В РЎвЂ�Р В Р’В·Р В Р’В°Р РЋРІР‚В Р В РЎвЂ�Р В РЎвЂ� Р В РўвЂ�Р В РЎвЂ�Р РЋР С“Р В РЎвЂ”Р В Р’В»Р В Р’ВµР РЋР РЏ Р В Р вЂ¦Р В Р’В° Р В РЎвЂќР В РЎвЂўР В Р вЂ¦Р РЋРІР‚С™Р РЋР вЂљР В РЎвЂўР В Р’В»Р В Р’В»Р В Р’ВµР РЋР вЂљР В Р’Вµ ssd1306(Р В РїС—Р…Р В Р’В·Р В РЎпїЅР В Р’ВµР В Р вЂ¦Р РЋР РЏР РЋР вЂ№ Р РЋР С“ HAL)
//	Р В РЎпїЅР В РЎвЂўР В РўвЂ�Р РЋРЎвЂњР В Р’В»Р РЋР Р‰ I2C Р В РЎвЂ� Р В Р вЂ¦Р В РЎвЂўР В РЎвЂ“Р В Р’В° Reset Р РЋРЎвЂњР В Р’В¶Р В Р’Вµ Р В РўвЂ�Р В РЎвЂўР В Р’В»Р В Р’В¶Р В Р вЂ¦Р РЋРІР‚в„– Р В Р’В±Р РЋРІР‚в„–Р РЋРІР‚С™Р РЋР Р‰ Р В Р вЂ¦Р В Р’В°Р РЋР С“Р РЋРІР‚С™Р РЋР вЂљР В РЎвЂўР В Р’ВµР В Р вЂ¦Р РЋРІР‚в„–
//==============================================================================
void SSD1306_Init(uint8_t width, uint8_t height)
{
//	uint8_t Width = width;
//	uint8_t Height = height;
// Р·Р°РєРѕРјРµРЅС‚Р°СЂРёР» СЌС‚Рѕ СЏ РЅРµ СЋР·Р°СЋ
//  HAL_GPIO_WritePin(Reset_GPIO_Port, Reset_Pin, GPIO_PIN_SET);
//  HAL_Delay(2);
//  HAL_GPIO_WritePin(Reset_GPIO_Port, Reset_Pin, GPIO_PIN_RESET);
//  HAL_Delay(15);
//  HAL_GPIO_WritePin(Reset_GPIO_Port, Reset_Pin, GPIO_PIN_SET);

  SSD1306_SendCOM(ComArr);
}
//==============================================================================
// Р В РЎСџР РЋР вЂљР В РЎвЂўР РЋРІР‚В Р В Р’ВµР В РўвЂ�Р РЋРЎвЂњР РЋР вЂљР В Р’В° Р В РЎвЂ”Р В Р’ВµР РЋР вЂљР В Р’ВµР В РўвЂ�Р В Р’В°Р РЋРІР‚пїЅР РЋРІР‚С™ Р В Р вЂ  Р В РўвЂ�Р В РЎвЂ�Р РЋР С“Р В РЎвЂ”Р В Р’В»Р В Р’ВµР В РІвЂћвЂ“ Р В Р’В±Р РЋРЎвЂњР РЋРІР‚С›Р В Р’ВµР РЋР вЂљ Р В РЎвЂќР В Р’В°Р В РўвЂ�Р РЋР вЂљР В Р’В° Р В РЎвЂ�Р В Р’В· Р В РЎпїЅР В Р’В°Р РЋР С“Р РЋР С“Р В РЎвЂ�Р В Р вЂ Р В Р’В° pBuff
//==============================================================================
void SSD1306_DisplayFullUpdate(uint8_t *pBuff, uint16_t BuffLen)
{
	while (HAL_I2C_GetState(&hi2c2) != HAL_I2C_STATE_READY)
				{
				}
	//Р В Р в‚¬Р РЋР С“Р РЋРІР‚С™Р В Р’В°Р В Р вЂ¦Р В Р’В°Р В Р вЂ Р В Р’В»Р В РЎвЂ�Р В Р вЂ Р В Р’В°Р В Р’ВµР РЋРІР‚С™ Р РЋРЎвЂњР В РЎвЂќР В Р’В°Р В Р’В·Р В Р’В°Р РЋРІР‚С™Р В Р’ВµР В Р’В»Р РЋР Р‰ Р В Р вЂ  Р В Р вЂ¦Р В Р’В°Р РЋРІР‚РЋР В Р’В°Р В Р’В»Р В РЎвЂў.
	SSD1306_SendCOM(ComArrSet);
	SendData(pBuff, BuffLen);
}
// Sends an array of commands for initialization.
void SSD1306_SendCOM(uint8_t *Arr){
	  ptrCom = Arr;
	  ptrNexCom = Arr;
	  Size = *ptrCom++ ;

	  ptrNexCom+= Size +1;
	  HAL_I2C_MasterTxCpltCallback(&hi2c2);
}
//==============================================================================
// Р В РЎСџР РЋР вЂљР В РЎвЂўР РЋРІР‚В Р В Р’ВµР В РўвЂ�Р РЋРЎвЂњР РЋР вЂљР В Р’В° Р В РЎвЂ”Р В Р’ВµР РЋР вЂљР В Р’ВµР В РўвЂ�Р В Р’В°Р РЋРІР‚пїЅР РЋРІР‚С™ Р В РЎпїЅР В Р’В°Р РЋР С“Р РЋР С“Р В РЎвЂ�Р В Р вЂ  Р В РўвЂ�Р В Р’В°Р В Р вЂ¦Р В Р вЂ¦Р РЋРІР‚в„–Р РЋРІР‚В¦ Р В Р вЂ  ssd1306
//==============================================================================
void SendData(uint8_t *pBuff, uint16_t BuffLen){
// Р РЋРЎвЂњР В Р вЂ Р В Р’ВµР В Р’В»Р В РЎвЂ�Р РЋРІР‚РЋР В РЎвЂ�Р В Р вЂ Р В Р’В°Р РЋР вЂ№ Р В Р’В±Р РЋРЎвЂњР РЋРІР‚С›Р В Р’ВµР РЋР вЂљ Р В РЎвЂќР В Р’В°Р В РўвЂ�Р РЋР вЂљР В Р’В° Р В Р вЂ¦Р В Р’В° 1 Р В Р’В±Р В Р’В°Р В РІвЂћвЂ“Р РЋРІР‚С™, Р РЋРІР‚С™Р РЋРЎвЂњР В РўвЂ�Р В Р’В° Р В Р’В·Р В Р’В°Р В РЎвЂ”Р В РЎвЂ�Р РЋР С“Р РЋРІР‚в„–Р В Р вЂ Р В Р’В°Р РЋР вЂ№ 1 Р В РЎвЂќР В РЎвЂўР В РЎпїЅР В Р’В°Р В Р вЂ¦Р В РўвЂ�Р РЋРЎвЂњ.
	pBuff[0] = 0x40;
	//Р В РІР‚вЂњР В РўвЂ�Р РЋРЎвЂњ Р В РЎвЂ”Р В РЎвЂўР В РЎвЂќР В Р’В° Р В Р вЂ¦Р В Р’Вµ Р В Р’В·Р В Р’В°Р В РЎвЂќР В РЎвЂўР В Р вЂ¦Р РЋРІР‚РЋР В РЎвЂ�Р РЋРІР‚С™Р РЋР Р‰Р РЋР С“Р РЋР РЏ Р В РЎвЂ”Р РЋР вЂљР В Р’ВµР В РўвЂ�Р РЋРІР‚в„–Р В РўвЂ�Р РЋРЎвЂњР РЋРІР‚В°Р В Р’В°Р РЋР РЏ Р В РЎвЂ”Р В Р’ВµР РЋР вЂљР В Р’ВµР В РўвЂ�Р В Р’В°Р РЋРІР‚РЋР В Р’В°
	while (HAL_I2C_GetState(&hi2c2) != HAL_I2C_STATE_READY)
				{
				}
	//Р В РЎСљР В Р’В°Р РЋРІР‚РЋР В Р’В°Р В Р’В» Р В РЎвЂ”Р В Р’ВµР РЋР вЂљР В Р’ВµР В РўвЂ�Р В Р’В°Р РЋРІР‚РЋР РЋРЎвЂњ
	if(HAL_I2C_Master_Transmit_IT(&hi2c2, (uint16_t)I2C_ADDRESS, (uint8_t*)(pBuff),BufLen)!= HAL_OK)
				{ // Р В РЎпїЅР В РЎвЂўР В Р’В¶Р В Р вЂ¦Р В РЎвЂў Р В РўвЂ�Р В РЎвЂўР В Р’В±Р В Р’В°Р В Р вЂ Р В РЎвЂ�Р РЋРІР‚С™Р РЋР Р‰ Р В РЎвЂќР В РЎвЂўР В РўвЂ� Р В РЎвЂўР В Р’В±Р РЋР вЂљР В Р’В°Р В Р’В±Р В РЎвЂўР РЋРІР‚С™Р РЋРІР‚РЋР В РЎвЂ�Р В РЎвЂќР В Р’В° Р В РЎвЂўР РЋРІвЂљВ¬Р В РЎвЂ�Р В Р’В±Р В РЎвЂќР В РЎвЂ�.

				}
}
